"use strict";

let dcm = 0.1;
let km = 1000;
let m = 1;
let mm = 0.001;
let sm = 0.01;

let N = prompt('Выберите елиницу измерения');
let L = +prompt('Введите длину отрезка');

if (N == 'Дециметр' || N == 'дециметр' || N == 'Дециметры' || N == 'дециметры') {
    L = L * dcm;
    alert(`${L} метров`);
}
else if (N == 'Километр' || N == 'километр' || N == 'Километры' || N == 'километры' || N == 'Км' || N == 'км') {
    L = L * km;
    alert(`${L} метров`);
}
else if (N == 'Метр' || N == 'метр' || N == 'Метры' || N == 'метры' || N == 'М' || N == 'м') {
    L = L * m;
    alert(`${L} метров`);
}
else if (N == 'Миллиметр' || N == 'миллиметр' || N == 'Миллиметры' || N == 'миллиметры' || N == 'мм' || N == 'Мм') {
    L = L * mm;
    alert(`${L} метров`);
}
else if (N == 'Сантиметр' || N == 'сантиметр' || N == 'Сантиметры' || N == 'сантиметры' || N == 'См' || N == 'см') {
    L = L * sm;
    alert(`${L} метров`);
}
else {
    alert('Конвертер классный, но не настолько');
}
